  # Challenge

  ## Identifying Outliers using Standard Deviation

In [2]:
# initial imports
import pandas as pd
import numpy as np
from numpy.random import randn
import random
from sqlalchemy import create_engine

In [5]:
# create a connection to the database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/week7_sql_4")

In [6]:
# Define a query to view the money spent by each customer
query= """
SELECT *
FROM customer_money;
"""

# Load data into the DataFrame using the read_sql() method from pandas
customer_money_df= pd.read_sql(query, engine)

customer_money_df.tail()

      ch_id  amount
3281     25  1074.0
3282     25  1162.0
3283     25  1177.0
3284     25  1334.0
3285     25  1813.0

In [43]:
# code a function to identify outliers based on standard deviation
std_dev= customer_money_df.groupby('ch_id').apply(np.std)

std_dev.drop(columns= ['ch_id'], inplace= True)
std_dev.head()

           amount
ch_id
1      371.519052
2        5.625458
3      328.843562
4        5.832074
5        5.882024

In [44]:
# Find the mean
mean= customer_money_df.groupby('ch_id').apply(np.mean)

mean.drop(columns= ['ch_id'], inplace= True)
mean.head()

           amount
ch_id
1      117.986613
2        9.560947
3      141.583860
4        9.223116
5        9.118175

In [48]:
# Seed the random number generator
random.seed (1)

# Generate univariate observations
univariate_observations= mean* randn(1)* std_dev
univariate_observations.head()

             amount
ch_id
1     -54714.521075
2        -67.134787
3     -58115.485290
4        -67.141260
5        -66.945822

In [40]:
# Statistics for the univariate observations
uni_mean= univariate_observations.groupby('ch_id').apply(np.mean)
uni_mean.head()

            amount
ch_id
1     -1954.080397
2        -2.397659
3     -2075.542805
4        -2.397890
5        -2.390910

In [51]:
uni_std= univariate_observations.groupby('ch_id').apply(np.std)
uni_std.head()

       amount
ch_id
1         0.0
2         0.0
3         0.0
4         0.0
5         0.0

In [50]:
# Identify outliers
cut_off= uni_std* 3
cut_off.head()

       amount
ch_id
1         0.0
2         0.0
3         0.0
4         0.0
5         0.0

In [55]:
# Upper and Lower limit of the outliers
lower_outlier= uni_mean- cut_off
lower_outlier.head()

upper_outlier= uni_mean+ cut_off
upper_outlier.head()

            amount
ch_id
1     -1954.080397
2        -2.397659
3     -2075.542805
4        -2.397890
5        -2.390910

In [ ]:
# find anomalous transactions for 3 random card holders

  ## Identifying Outliers Using Interquartile Range

In [ ]:
# code a function to identify outliers based on interquartile range

In [ ]:
# find anomalous transactions for 3 random card holders